c5/src/Documents/LVIInventory/LVIInventory.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>LVIInventory</name>
  <attributes>
    <name>Account</name>
    <type>
      <types>ChartOfAccountsRef.General</types>
    </type>
  </attributes>
  <attributes>
    <name>Amount</name>
    <type>
      <types>DefinedType.Amount</types>
    </type>
  </attributes>
  <attributes>
    <name>Company</name>
    <type>
      <types>CatalogRef.Companies</types>
    </type>
  </attributes>
  <attributes>
    <name>Creator</name>
    <type>
      <types>CatalogRef.Users</types>
    </type>
  </attributes>
  <attributes>
    <name>Department</name>
    <type>
      <types>CatalogRef.Departments</types>
    </type>
  </attributes>
  <attributes>
    <name>Memo</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Items</name>
    <attributes>
      <name>Account</name>
      <type>
        <types>ChartOfAccountsRef.General</types>
      </type>
    </attributes>
    <attributes>
      <name>Amount</name>
      <type>
        <types>DefinedType.Amount</types>
      </type>
    </attributes>
    <attributes>
      <name>AmountBalance</name>
      <type>
        <types>DefinedType.Amount</types>
      </type>
    </attributes>
    <attributes>
      <name>AmountDifference</name>
      <type>
        <types>DefinedType.Amount</types>
      </type>
    </attributes>
    <attributes>
      <name>Capacity</name>
      <type>
        <types>DefinedType.Quantity</types>
      </type>
    </attributes>
    <attributes>
      <name>Feature</name>
      <type>
        <types>CatalogRef.Features</types>
      </type>
    </attributes>
    <attributes>
      <name>Item</name>
      <type>
        <types>CatalogRef.Items</types>
      </type>
    </attributes>
    <attributes>
      <name>Package</name>
      <type>
        <types>CatalogRef.Packages</types>
      </type>
    </attributes>
    <attributes>
      <name>Price</name>
      <type>
        <types>DefinedType.Price</types>
      </type>
    </attributes>
    <attributes>
      <name>PriceBalance</name>
      <type>
        <types>DefinedType.Price</types>
      </type>
    </attributes>
    <attributes>
      <name>Quantity</name>
      <type>
        <types>DefinedType.Quantity</types>
      </type>
    </attributes>
    <attributes>
      <name>QuantityBalance</name>
      <type>
        <types>DefinedType.Quantity</types>
      </type>
    </attributes>
    <attributes>
      <name>QuantityDifference</name>
      <type>
        <types>DefinedType.Quantity</types>
      </type>
    </attributes>
    <attributes>
      <name>QuantityPkg</name>
      <type>
        <types>DefinedType.Quantity</types>
      </type>
    </attributes>
    <attributes>
      <name>QuantityPkgBalance</name>
      <type>
        <types>DefinedType.Quantity</types>
      </type>
    </attributes>
    <attributes>
      <name>QuantityPkgDifference</name>
      <type>
        <types>DefinedType.Quantity</types>
      </type>
    </attributes>
    <attributes>
      <name>Series</name>
      <type>
        <types>CatalogRef.Series</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

c5/src/AccountingRegisters/General/General.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccountingRegister>
  <name>General</name>
  <chartOfAccounts>ChartOfAccounts.General</chartOfAccounts>
  <correspondence>true</correspondence>
  <dimensions>
    <name>Company</name>
    <type>
      <types>CatalogRef.Companies</types>
    </type>
    <balance>true</balance>
  </dimensions>
  <dimensions>
    <name>Currency</name>
    <type>
      <types>CatalogRef.Currencies</types>
    </type>
    <accountingFlag>ChartOfAccounts.General.AccountingFlag.Currency</accountingFlag>
  </dimensions>
  <resources>
    <name>Quantity</name>
    <type>
      <types>DefinedType.Quantity</types>
    </type>
    <accountingFlag>ChartOfAccounts.General.AccountingFlag.Quantitative</accountingFlag>
    <extDimensionAccountingFlag>ChartOfAccounts.General.ExtDimensionAccountingFlag.Quantitative</extDimensionAccountingFlag>
  </resources>
  <resources>
    <name>Amount</name>
    <type>
      <types>DefinedType.Amount</types>
    </type>
    <balance>true</balance>
    <extDimensionAccountingFlag>ChartOfAccounts.General.ExtDimensionAccountingFlag.Accrual</extDimensionAccountingFlag>
  </resources>
  <resources>
    <name>CurrencyAmount</name>
    <type>
      <types>DefinedType.Amount</types>
    </type>
    <accountingFlag>ChartOfAccounts.General.AccountingFlag.Currency</accountingFlag>
    <extDimensionAccountingFlag>ChartOfAccounts.General.ExtDimensionAccountingFlag.Currency</extDimensionAccountingFlag>
  </resources>
  <attributes>
    <name>Content</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Operation</name>
    <type>
      <types>EnumRef.Operations</types>
    </type>
  </attributes>
  <attributes>
    <name>Dependency</name>
    <type>
      <types>DocumentRef.Payment</types>
      <types>DocumentRef.VendorInvoice</types>
      <types>DocumentRef.CustomsDeclaration</types>
      <types>DocumentRef.Production</types>
    </type>
  </attributes>
</mdclass:AccountingRegister>

c5/src/Documents/ReceiveItems/ReceiveItems.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ReceiveItems</name>
  <basedOn>Document.Inventory</basedOn>
  <basedOn>Document.AssetsWriteOff</basedOn>
  <basedOn>Document.LVIInventory</basedOn>
  <basedOn>Document.AssetsInventory</basedOn>
  <basedOn>Document.IntangibleAssetsInventory</basedOn>
  <registerRecords>InformationRegister.IntangibleAssetsLocation</registerRecords>
  <registerRecords>InformationRegister.ProducerPrices</registerRecords>
  <registerRecords>InformationRegister.Depreciation</registerRecords>
  <registerRecords>InformationRegister.Amortization</registerRecords>
  <registerRecords>AccumulationRegister.Items</registerRecords>
  <registerRecords>InformationRegister.FixedAssetsLocation</registerRecords>
  <registerRecords>AccountingRegister.General</registerRecords>
  <registerRecords>AccumulationRegister.Cost</registerRecords>
  <attributes>
    <name>Account</name>
    <type>
      <types>ChartOfAccountsRef.General</types>
    </type>
  </attributes>
  <attributes>
    <name>Amount</name>
    <type>
      <types>DefinedType.Amount</types>
    </type>
  </attributes>
  <attributes>
    <name>Company</name>
    <type>
      <types>CatalogRef.Companies</types>
    </type>
  </attributes>
  <attributes>
    <name>Creator</name>
    <type>
      <types>CatalogRef.Users</types>
    </type>
  </attributes>
  <attributes>
    <name>Currency</name>
    <type>
      <types>CatalogRef.Currencies</types>
    </type>
  </attributes>
  <attributes>
    <name>Dim1</name>
    <type>
      <types>Characteristic.Dimensions</types>
    </type>
  </attributes>
  <attributes>
    <name>Dim2</name>
    <type>
      <types>Characteristic.Dimensions</types>
    </type>
  </attributes>
  <attributes>
    <name>Dim3</name>
    <type>
      <types>Characteristic.Dimensions</types>
    </type>
  </attributes>
  <attributes>
    <name>Factor</name>
    <type>
      <types>DefinedType.Factor</types>
    </type>
  </attributes>
  <attributes>
    <name>Inventory</name>
    <type>
      <types>DocumentRef.IntangibleAssetsInventory</types>
      <types>DocumentRef.Inventory</types>
      <types>DocumentRef.AssetsInventory</types>
      <types>DocumentRef.LVIInventory</types>
    </type>
  </attributes>
  <attributes>
    <name>Memo</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Prices</name>
    <type>
      <types>CatalogRef.Prices</types>
    </type>
  </attributes>
  <attributes>
    <name>Rate</name>
    <type>
      <types>DefinedType.Rate</types>
    </type>
  </attributes>
  <attributes>
    <name>VAT</name>
    <type>
      <types>DefinedType.Amount</types>
    </type>
  </attributes>
  <attributes>
    <name>VATUse</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Warehouse</name>
    <type>
      <types>CatalogRef.Warehouses</types>
    </type>
  </attributes>
  <tabularSections>
    <name>FixedAssets</name>
    <attributes>
      <name>Acceleration</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Amount</name>
      <type>
        <types>DefinedType.Amount</types>
      </type>
    </attributes>
    <attributes>
      <name>Charge</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Department</name>
      <type>
        <types>CatalogRef.Departments</types>
      </type>
    </attributes>
    <attributes>
      <name>Employee</name>
      <type>
        <types>CatalogRef.Employees</types>
      </type>
    </attributes>
    <attributes>
      <name>Expenses</name>
      <type>
        <types>CatalogRef.ExpenseMethods</types>
      </type>
    </attributes>
    <attributes>
      <name>Item</name>
      <type>
        <types>CatalogRef.FixedAssets</types>
      </type>
    </attributes>
    <attributes>
      <name>LiquidationValue</name>
      <type>
        <types>DefinedType.Amount</types>
      </type>
    </attributes>
    <attributes>
      <name>Method</name>
      <type>
        <types>EnumRef.Amortization</types>
      </type>
    </attributes>
    <attributes>
      <name>Schedule</name>
      <type>
        <types>CatalogRef.DepreciationSchedules</types>
      </type>
    </attributes>
    <attributes>
      <name>Starting</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Total</name>
      <type>
        <types>DefinedType.Amount</types>
      </type>
    </attributes>
    <attributes>
      <name>UsefulLife</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>VAT</name>
      <type>
        <types>DefinedType.Amount</types>
      </type>
    </attributes>
    <attributes>
      <name>VATCode</name>
      <type>
        <types>CatalogRef.VAT</types>
      </type>
    </attributes>
    <attributes>
      <name>VATRate</name>
      <type>
        <types>DefinedType.TaxRate</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>IntangibleAssets</name>
    <attributes>
      <name>Acceleration</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Amount</name>
      <type>
        <types>DefinedType.Amount</types>
      </type>
    </attributes>
    <attributes>
      <name>Charge</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Department</name>
      <type>
        <types>CatalogRef.Departments</types>
      </type>
    </attributes>
    <attributes>
      <name>Employee</name>
      <type>
        <types>CatalogRef.Employees</types>
      </type>
    </attributes>
    <attributes>
      <name>Expenses</name>
      <type>
        <types>CatalogRef.ExpenseMethods</types>
      </type>
    </attributes>
    <attributes>
      <name>Item</name>
      <type>
        <types>CatalogRef.IntangibleAssets</types>
      </type>
    </attributes>
    <attributes>
      <name>Method</name>
      <type>
        <types>EnumRef.Amortization</types>
      </type>
    </attributes>
    <attributes>
      <name>Starting</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Total</name>
      <type>
        <types>DefinedType.Amount</types>
      </type>
    </attributes>
    <attributes>
      <name>UsefulLife</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>VAT</name>
      <type>
        <types>DefinedType.Amount</types>
      </type>
    </attributes>
    <attributes>
      <name>VATCode</name>
      <type>
        <types>CatalogRef.VAT</types>
      </type>
    </attributes>
    <attributes>
      <name>VATRate</name>
      <type>
        <types>DefinedType.TaxRate</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Items</name>
    <attributes>
      <name>Account</name>
      <type>
        <types>ChartOfAccountsRef.General</types>
      </type>
    </attributes>
    <attributes>
      <name>Amount</name>
      <type>
        <types>DefinedType.Amount</types>
      </type>
    </attributes>
    <attributes>
      <name>Capacity</name>
      <type>
        <types>DefinedType.Quantity</types>
      </type>
    </attributes>
    <attributes>
      <name>Feature</name>
      <type>
        <types>CatalogRef.Features</types>
      </type>
    </attributes>
    <attributes>
      <name>Item</name>
      <type>
        <types>CatalogRef.Items</types>
      </type>
    </attributes>
    <attributes>
      <name>Package</name>
      <type>
        <types>CatalogRef.Packages</types>
      </type>
    </attributes>
    <attributes>
      <name>Price</name>
      <type>
        <types>DefinedType.Price</types>
      </type>
    </attributes>
    <attributes>
      <name>Prices</name>
      <type>
        <types>CatalogRef.Prices</types>
      </type>
    </attributes>
    <attributes>
      <name>ProducerPrice</name>
      <type>
        <types>DefinedType.Price</types>
      </type>
    </attributes>
    <attributes>
      <name>Quantity</name>
      <type>
        <types>DefinedType.Quantity</types>
      </type>
    </attributes>
    <attributes>
      <name>QuantityPkg</name>
      <type>
        <types>DefinedType.Quantity</types>
      </type>
    </attributes>
    <attributes>
      <name>Series</name>
      <type>
        <types>CatalogRef.Series</types>
      </type>
    </attributes>
    <attributes>
      <name>Social</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Total</name>
      <type>
        <types>DefinedType.Amount</types>
      </type>
    </attributes>
    <attributes>
      <name>VAT</name>
      <type>
        <types>DefinedType.Amount</types>
      </type>
    </attributes>
    <attributes>
      <name>VATCode</name>
      <type>
        <types>CatalogRef.VAT</types>
      </type>
    </attributes>
    <attributes>
      <name>VATRate</name>
      <type>
        <types>DefinedType.TaxRate</types>
      </type>
    </attributes>
    <attributes>
      <name>Warehouse</name>
      <type>
        <types>CatalogRef.Warehouses</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

c5/src/Documents/LVIInventory/Forms/Form/Module.bsl
&AtServer
var Env;
&AtServer
var ViewReceiveItems;
&AtServer
var ViewLVIWriteOff;
&AtClient
var ItemsRow;

// *****************************************
// *********** Form events

&AtServer
Procedure OnReadAtServer ( CurrentObject )
	
	Constraints.ShowAccess ( ThisObject );
	Appearance.Apply ( ThisObject );
	
EndProcedure

&AtServer
Procedure OnCreateAtServer ( Cancel, StandardProcessing )
	
	if ( isNew () ) then
		DocumentForm.Init ( Object );
		fillNew ();
		Constraints.ShowAccess ( ThisObject );
	endif; 
	Options.SetAccuracy ( ThisObject, "ItemsQuantity, ItemsQuantityPkg, ItemsQuantityBalance, ItemsQuantityPkgBalance, ItemsQuantityPkgDifference, ItemsQuantityDifference" );
	setLinks ();
	Options.Company ( ThisObject, Object.Company );
	StandardButtons.Arrange ( ThisObject );
	readAppearance ();
	Appearance.Apply ( ThisObject );
	
EndProcedure

&AtServer
Function isNew ()
	
	return Object.Ref.IsEmpty ();
	
EndFunction

&AtServer
Procedure readAppearance ()

	rules = new Array ();
	rules.Add ( "
	|Links show ShowLinks
	|" );
	Appearance.Read ( ThisObject, rules );

EndProcedure

&AtServer
Procedure fillNew ()
	
	if ( not Parameters.CopyingValue.IsEmpty () ) then
		return;
	endif; 
	if ( Object.Department.IsEmpty () ) then
		settings = Logins.Settings ( "Company, Department" );
		Object.Company = settings.Company;
		Object.Department = settings.Department;
	else
		Object.Company = DF.Pick ( Object.Department, "Owner" );
	endif;
	
EndProcedure 

&AtServer
Procedure setLinks ()
	
	SQL.Init ( Env );
	sqlLinks ();
	if ( Env.Selection.Count () = 0 ) then
		ShowLinks = false;
	else
		Env.Q.SetParameter ( "Ref", Object.Ref );
		SQL.Perform ( Env );
		setURLPanel ();
	endif;

EndProcedure 

&AtServer
Procedure sqlLinks ()
	
	if ( isNew () ) then
		return;
	endif; 
	meta = Metadata.Documents;
	ViewReceiveItems = AccessRight ( "View", meta.ReceiveItems );
	if ( ViewReceiveItems ) then
		s = "
		|// #ReceiveItems
		|select Documents.Ref as Document, Documents.Date as Date, Documents.Number as Number
		|from Document.ReceiveItems as Documents
		|where Documents.Inventory = &Ref
		|and not Documents.DeletionMark
		|";
		Env.Selection.Add ( s );
	endif; 
	ViewLVIWriteOff = AccessRight ( "View", meta.LVIWriteOff );
	if ( ViewLVIWriteOff ) then
		s = "
		|// #LVIWriteOff
		|select Documents.Ref as Document, Documents.Date as Date, Documents.Number as Number
		|from Document.LVIWriteOff as Documents
		|where Documents.LVIInventory = &Ref
		|and not Documents.DeletionMark
		|";
		Env.Selection.Add ( s );
	endif; 
	
EndProcedure 

&AtServer
Procedure setURLPanel ()
	
	parts = new Array ();
	meta = Metadata.Documents;
	if ( not isNew () ) then
		if ( ViewReceiveItems ) then
			parts.Add ( URLPanel.DocumentsToURL ( Env.ReceiveItems, meta.ReceiveItems ) );
		endif; 
		if ( ViewLVIWriteOff ) then
			parts.Add ( URLPanel.DocumentsToURL ( Env.LVIWriteOff, meta.LVIWriteOff ) );
		endif; 
	endif; 
	s = URLPanel.Build ( parts );
	if ( s = undefined ) then
		ShowLinks = false;
	else
		ShowLinks = true;
		Links = s;
	endif; 
	Appearance.Apply ( ThisObject, "ShowLinks" )
	
EndProcedure 

&AtClient
Procedure NotificationProcessing ( EventName, Parameter, Source )
	
	if ( EventName = Enum.MessageChangesPermissionIsSaved ()
		and ( Parameter = Object.Ref
			or Parameter = BegOfDay ( Object.Date ) ) ) then
		updateChangesPermission ();
	endif;

EndProcedure

&AtServer
Procedure updateChangesPermission ()

	Constraints.ShowAccess ( ThisObject );

EndProcedure

&AtClient
Procedure BeforeWrite ( Cancel, WriteParameters )
	
	Forms.DeleteLastRow ( Object.Items, "Item" );
	calcTotals ( Object );
	
EndProcedure

&AtClient
Procedure calcTotals ( Object )
	
	Object.Amount = Object.Items.Total ( "Amount" );
	
EndProcedure 

&AtClient
Procedure NewWriteProcessing ( NewObject, Source, StandardProcessing )
	
	readNew ( NewObject );
	
EndProcedure

&AtServer
Procedure readNew ( NewObject ) 

	type = TypeOf ( NewObject );
	if ( type = Type ( "DocumentRef.ReceiveItems" )
		or type = Type ( "DocumentRef.LVIWriteOff" ) ) then
		setLinks ();
		Appearance.Apply ( ThisObject, "ShowLinks" );
	else
		return;
	endif;
	
EndProcedure

// *****************************************
// *********** Group Form

&AtClient
Procedure DateOnChange ( Item )
	
	updateChangesPermission ();
	
EndProcedure

&AtClient
Procedure CompanyOnChange ( Item )
	
	Options.ApplyCompany ( ThisObject );
	
EndProcedure

// *****************************************
// *********** Table Items

&AtClient
Procedure Fill ( Command )
	
	if ( Forms.Check ( ThisObject, "Department" ) ) then
		Output.UpdateInventory ( ThisObject );
	endif; 
	
EndProcedure

&AtClient
Procedure UpdateInventory ( Answer, Params ) export
	
	if ( Answer = DialogReturnCode.No ) then
		return;
	endif; 
	fillTable ();
	
EndProcedure 

&AtServer
Procedure fillTable ()
	
	table = getTable ();
	itemsTable = Object.Items;
	search = new Structure ( "Item, Package, Feature, Series, Account" );
	for each row in table do
		FillPropertyValues ( search, row );
		foundRows = itemsTable.FindRows ( search );
		found = foundRows.Count () > 0;
		if ( found ) then
			itemsRow = foundRows [ 0 ];
		else
			itemsRow = itemsTable.Add ();
			FillPropertyValues ( itemsRow, row );
		endif; 
		itemsRow.QuantityBalance = row.Quantity;
		itemsRow.QuantityPkgBalance = row.QuantityPkg;
		itemsRow.PriceBalance = row.Price;
		itemsRow.AmountBalance = row.Amount;
		if ( found ) then
			calcDifference ( itemsRow );
		endif; 
	enddo; 
	
EndProcedure

&AtServer
Function getTable ()
	
	s = "
	|select Balances.QuantityBalanceDr as QuantityPkg,
	|	Balances.ExtDimension1 as Item, Balances.AmountBalanceDr as Amount,
	|	Balances.Account as Account, Balances.ExtDimension1.Package as Package,
	|	isnull ( Balances.ExtDimension1.Package.Capacity, 1 ) as Capacity,
	|	Balances.QuantityBalanceDr * isnull ( Balances.ExtDimension1.Package.Capacity, 1 ) as Quantity,
	|	cast ( case when Balances.QuantityBalanceDr = 0 then 0 else Balances.AmountBalanceDr / Balances.QuantityBalanceDr end as Number ( 15, 2 ) ) as Price
	|from AccountingRegister.General.Balance ( &Date, Account = &Account, , ExtDimension2 = &Department ) as Balances
	|";
	q = new Query ( s );
	q.SetParameter ( "Department", Object.Department );
	q.SetParameter ( "Account", Object.Account );
	q.SetParameter ( "Date", Periods.GetBalanceDate ( Object ) );
	table = q.Execute ().Unload ();
	table.Indexes.Add ( "Item, Package, Account, Price" );
	return table;
	
EndFunction 

&AtClientAtServerNoContext
Procedure calcDifference ( ItemsRow )
	
	ItemsRow.QuantityDifference = ItemsRow.Quantity - ItemsRow.QuantityBalance;
	ItemsRow.QuantityPkgDifference = ItemsRow.QuantityPkg - ItemsRow.QuantityPkgBalance;
	ItemsRow.AmountDifference = ItemsRow.Amount - ItemsRow.AmountBalance;
	
EndProcedure

&AtClient
Procedure ItemsOnActivateRow ( Item )
	
	ItemsRow = Item.CurrentData;
	
EndProcedure

&AtClient
Procedure ItemsOnEditEnd ( Item, NewRow, CancelEdit )
	
	calcTotals ( Object );
	
EndProcedure

&AtClient
Procedure ItemsAfterDeleteRow ( Item )
	
	calcTotals ( Object );
	
EndProcedure

&AtClient
Procedure ItemsItemOnChange ( Item )
	
	applyItem ();
	
EndProcedure

&AtClient
Procedure applyItem ()
	
	p = new Structure ();
	p.Insert ( "Date", Object.Date );
	p.Insert ( "Company", Object.Company );
	p.Insert ( "Item", ItemsRow.Item );
	data = getItemData ( p );
	ItemsRow.Package = data.Package;
	ItemsRow.Capacity = data.Capacity;
	ItemsRow.Account = data.Account;
	Computations.Units ( ItemsRow );
	Computations.Amount ( ItemsRow );
	calcDifference ( ItemsRow );
	
EndProcedure 

&AtServerNoContext
Function getItemData ( val Params )
	
	data = DF.Values ( Params.Item, "Package, Package.Capacity as Capacity" );
	accounts = AccountsMap.Item ( Params.Item, Params.Company, , "Account" );
	data.Insert ( "Account", accounts.Account );
	if ( data.Capacity = 0 ) then
		data.Capacity = 1;
	endif; 
	return data;
	
EndFunction 

&AtClient
Procedure ItemsQuantityPkgOnChange ( Item )
	
	Computations.Units ( ItemsRow );
	Computations.Amount ( ItemsRow );
	calcDifference ( ItemsRow );
	
EndProcedure

&AtClient
Procedure ItemsPackageOnChange ( Item )
	
	applyPackage ();
	
EndProcedure

&AtClient
Procedure applyPackage ()
	
	ItemsRow.Capacity = DF.Pick ( ItemsRow.Package, "Capacity", 1 );
	Computations.Units ( ItemsRow );
	Computations.Amount ( ItemsRow );
	calcDifference ( ItemsRow );
	
EndProcedure 

&AtClient
Procedure ItemsQuantityOnChange ( Item )
	
	Computations.Packages ( ItemsRow );
	Computations.Amount ( ItemsRow );
	calcDifference ( ItemsRow );
	
EndProcedure

&AtClient
Procedure ItemsPriceOnChange ( Item )
	
	Computations.Amount ( ItemsRow );
	calcDifference ( ItemsRow );
	
EndProcedure

&AtClient
Procedure ItemsAmountOnChange ( Item )
	
	Computations.Price ( ItemsRow );
	calcDifference ( ItemsRow );
	
EndProcedure
